//main js file
"use strict";

//=========================================================================================
/*
Практика JS 10.
Напишіть функцію, яка прийматиме масив з іменами, і повертатиме масив, 
але вже з віддаленими небажаними іменами. Масив із небажаними іменами має бути
всередині вашої функції: 
const unwantedNames = [“Дима”, “Саша”, ”Ольга”, ”Микита”].

 Приклад коду:
   example(['Микита', 'Саша', 'Анастасія', 'Дима', 'Санич', 'Ольга', ]) => [Анастасія','Санич']
   example(['Олексій', 'Семен', 'Василиса', 'Діма', 'Максим', 'Ольга', ]) => ['Олексій','Семен','Василиса','Максим']
   example(['Алішер', 'Ольга', ]) => ['Алішер']
*/

function removeIntersection(array) {
  const unwantedNames = ['Дима', 'Саша', 'Ольга', 'Микита'];
  return array.filter(x => !unwantedNames.includes(x));
}

function getMessage(array) {
  console.log(`This is your array: \n${array}`);
  console.log(`This is your array after remove unwanted names: \n${removeIntersection(array)}`);
}

getMessage(['Микита', 'Саша', 'Анастасія', 'Дима', 'Санич', 'Ольга',]);

getMessage(['Олексій', 'Семен', 'Василиса', 'Діма', 'Максим', 'Ольга',]);

getMessage(['Алішер', 'Ольга',]);