//main js file
"use strict";

//=========================================================================================
/*
Практика JS 8.
Напишіть функцію, яка обчислює підсумкову оцінку студента в залежності від двох параметрів:
оцінки за іспит та кількість виконаних проектів. Ваша функція повинна приймати два аргументи: 
іспит – оцінка за іспит (від 0 до 100);
проекти – кількість реалізованих проектів (від 0 і вище); 
Ця функція має повертати число (підсумкова оцінка). 
Є чотири типи підсумкових оцінок:

100, якщо оцінка за іспит більша за 90 або кількість виконаних проектів більша за 10.
90, якщо оцінка за іспит більша за 75 або кількість виконаних проектів не менше ніж 5.
75, якщо оцінка за іспит більше 50 або кількість виконаних проектів не менше ніж 2.
0, в інших випадках
*/

const getAnswers = function () {
  let a, b = 0;
  do {
    a = +prompt('Enter your exam score (from 0 to 100): ');
    b = +prompt('Enter your number of implemented projects (from 0 and above): ');
  } while (!((a >= 0 && a <= 100) && (b >= 0)))
  return [a, b];
}

const culcFinalGrace = function () {
  let [score, pj] = getAnswers();
  let grace = 0;
  if (score > 90 || pj > 10) grace = 100
  else if (score > 75 || pj >= 5) grace = 90
  else if (score > 50 || pj >= 2) grace = 75
  else grace = 0;
  alert(`Your the final Grase is: ${grace}`);
}

culcFinalGrace();